# IsHydraulicLoopBoundary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystem..::..IsHydraulicLoopBoundary Method
PipingSystem Class See Also
---
Checks if the element is a valid hydraulic loop boundary.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public static bool IsHydraulicLoopBoundary(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function IsHydraulicLoopBoundary ( _
	element As Element _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsHydraulicLoopBoundary(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The element to be checked.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace